In [1]:
# Recommendation Systems

In [23]:
import pandas as pd

In [28]:
list = [ 
        { 
        "Student": [{"Exam": 90, "Grade": "a"}, 
                    {"Exam": 99, "Grade": "b"}, 
                    {"Exam": 97, "Grade": "c"}, 
                   ], 
        "Name": "Paras Jain"
        }, 
        { 
        "Student": [{"Exam": 89, "Grade": "a"}, 
                    {"Exam": 80, "Grade": "b"} 
                   ], 
        "Name": "Chunky Pandey"
        } 
       ]

In [29]:
print(list)

[{'Student': [{'Exam': 90, 'Grade': 'a'}, {'Exam': 99, 'Grade': 'b'}, {'Exam': 97, 'Grade': 'c'}], 'Name': 'Paras Jain'}, {'Student': [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Grade': 'b'}], 'Name': 'Chunky Pandey'}]

In [30]:
# rows list intialization 
rows = [] 
  
# appending rows 
for data in list: 
    data_row = data['Student'] 
    time = data['Name'] 
      
    for row in data_row: 
        row['Name']= time 
        rows.append(row) 
  
# using data frame 
df = pd.DataFrame(rows) 
  
# print(df)

In [31]:
df.head()

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey

In [32]:
# using pivot_table 
df = df.pivot_table(index ='Name', columns =['Grade'], 
                        values =['Exam']).reset_index() 
  
# Defining columns 
# df.columns =['Name', 'Maths', 'Physics', 'Chemistry'] 
  
# print dataframe 
print(df)

                Name  Exam
Grade                    a     b     c
0      Chunky Pandey  89.0  80.0   NaN
1         Paras Jain  90.0  99.0  97.0

In [11]:
df

            Name  Maths  Physics  Chemistry
0  Chunky Pandey   89.0     80.0        NaN
1     Paras Jain   90.0     99.0       97.0

In [33]:
df

                Name  Exam
Grade                    a     b     c
0      Chunky Pandey  89.0  80.0   NaN
1         Paras Jain  90.0  99.0  97.0

In [34]:
list

[{'Student': [{'Exam': 90, 'Grade': 'a', 'Name': 'Paras Jain'},
   {'Exam': 99, 'Grade': 'b', 'Name': 'Paras Jain'},
   {'Exam': 97, 'Grade': 'c', 'Name': 'Paras Jain'}],
  'Name': 'Paras Jain'},
 {'Student': [{'Exam': 89, 'Grade': 'a', 'Name': 'Chunky Pandey'},
   {'Exam': 80, 'Grade': 'b', 'Name': 'Chunky Pandey'}],
  'Name': 'Chunky Pandey'}]

In [35]:
dfnew= pd.DataFrame(list).T

In [36]:
dfnew

,0,1
Name,Paras Jain,Chunky Pandey
Student,"[{'Exam': 90, 'Grade': 'a', 'Name': 'Paras Jai...","[{'Exam': 89, 'Grade': 'a', 'Name': 'Chunky Pa..."